In [66]:
import pandas as pd
import matplotlib.pyplot as plt

In [67]:
df_clientes = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='clientes')
df_lojas = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='lojas')
df_produtos = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='produtos')
df_vendas = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='vendas')
df_pagamentos = pd.read_excel('../dataset/caso_estudo.xlsx', sheet_name='pagamentos')

# Analise preliminar

### df_clientes

In [68]:
df_clientes.sample(5)

      id             nome sexo     dt_nasc
605  606    Vitória Silva    F  10/18/1991
371  372  Emilly Ferreira    F   8/20/1970
788  789     Luis Ribeiro    M    2/8/1964
705  706    Sarah Barbosa    F   3/13/1939
618  619    Otávio Santos    M    6/8/1974

In [69]:
df_clientes.isnull().sum()

id         0
nome       4
sexo       4
dt_nasc    4
dtype: int64

In [70]:
# Identificando as linhas com algum dado nulo
df_clientes[df_clientes.isnull().T.any()]

      id               nome sexo     dt_nasc
263  264                NaN    F   7/29/1997
264  265                NaN    M    2/7/1979
268  269                NaN    F         NaN
269  270                NaN    M         NaN
276  277      Brenda Santos    F         NaN
282  283      Amanda Barros    F         NaN
287  288     Victor Ribeiro  NaN  12/17/1974
290  291        Clara Pinto  NaN  12/25/1980
294  295         Tiago Lima  NaN   7/26/1973
301  302  Guilherme Cardoso  NaN    3/9/1998

In [71]:
df_clientes.sexo.unique()

array(['F', 'M', nan], dtype=object)

### df_lojas

In [72]:
df_lojas

   id          cidade
0   1       São Paulo
1   2  Rio de Janeiro
2   3        Curitiba
3   4  Belo Horizonte
4   5  Santa Catarina
5   6          Recife
6   7        Salvador
7   8        Brasília
8   9          Palmas
9  10         Vitória

### df_produtos

In [73]:
df_produtos

   id        produto      valor
0   1          mouse       20.0
1   2        teclado       30.0
2   3  laptop básico     2300.0
3   4   laptop gamer     5300.0
4   5        monitor     1500.0
5   6     impressora      700.0
6   7     carregador      150.0
7   8        cadeira      540.0
8   9           mesa      860.0
9  10       xxx-231a  3211352.0

In [74]:
# Visualização por boxplot, excluindo o outlier 'xxx-231a'
df_produtos[df_produtos.valor < 3000000].boxplot(column=['valor'])

In [75]:
# Há vendas do produto xxx-231a?
df_vendas[df_vendas.id_produto == 10].count()

id            182
id_cliente    182
id_loja       182
id_produto    182
dt_venda      182
dtype: int64

### df_vendas

In [76]:
df_vendas.describe()

,id,id_cliente,id_loja,id_produto,dt_venda
count,3000.000000,3000.000000,3000.000000,3000.000000,3000
mean,1500.500000,500.763667,4.538333,4.435000,2019-05-17 17:48:28.799999744
min,1.000000,1.000000,1.000000,1.000000,2018-01-04 00:00:00
25%,750.750000,254.750000,2.000000,3.000000,2018-09-09 00:00:00
50%,1500.500000,503.500000,4.000000,3.000000,2019-05-20 00:00:00
75%,2250.250000,742.000000,7.000000,6.000000,2020-01-29 06:00:00
max,3000.000000,1000.000000,10.000000,10.000000,2020-09-27 00:00:00
std,866.169729,285.322282,2.922221,2.511018,NaN

### df_pagamento

In [77]:
df_pagamentos.isnull().sum()

id          0
id_venda    0
dt_pgto     0
dtype: int64

In [78]:
df_pagamentos.describe()

                id     id_venda                        dt_pgto
count  2072.000000  2072.000000                           2072
mean   1036.500000  1491.731660  2019-06-06 05:37:45.637065472
min       1.000000     1.000000            2018-01-10 00:00:00
25%     518.750000   746.250000            2018-10-01 12:00:00
50%    1036.500000  1501.500000            2019-06-10 00:00:00
75%    1554.250000  2220.500000            2020-02-08 00:00:00
max    2072.000000  2997.000000            2020-11-03 00:00:00
std     598.279199   864.865583                            NaN

# Data Cleanning

### Dados nulos

In [79]:
df_vendas[df_vendas.id_cliente == 264]

        id  id_cliente  id_loja  id_produto   dt_venda
229    230         264        2           3 2018-03-28
562    563         264        5           3 2018-07-07
1438  1439         264        3           3 2019-04-29
2021  2022         264        6           3 2019-11-08
2877  2878         264       10           3 2020-08-14

In [80]:
df_clientes.loc[df_clientes.nome.isnull(), 'nome'] = 'Sem nome'
df_clientes.loc[df_clientes.sexo.isnull(), 'sexo'] = 'O'
df_clientes.loc[df_clientes.dt_nasc.isnull(), 'dt_nasc'] = '1/1/2020'

In [81]:
df_clientes.loc[[269, 287], :]

      id            nome sexo     dt_nasc
269  270        Sem nome    M    1/1/2020
287  288  Victor Ribeiro    O  12/17/1974

### Outliers

In [82]:
df_produtos.loc[9, 'valor'] = df_produtos.valor[9]/10000
df_produtos

   id        produto      valor
0   1          mouse    20.0000
1   2        teclado    30.0000
2   3  laptop básico  2300.0000
3   4   laptop gamer  5300.0000
4   5        monitor  1500.0000
5   6     impressora   700.0000
6   7     carregador   150.0000
7   8        cadeira   540.0000
8   9           mesa   860.0000
9  10       xxx-231a   321.1352

In [83]:
df_produtos.boxplot(column=['valor'])